Repository: sillsdev/FwLocalizations
Catalog: messages.ms.tmx
Source language: en
Languages: ms

source: Stop at End of Word
ms: Berhenti di Hujung Perkataan

source: _Stop Parser
ms: _Hentikan Penghurai Kata

source: Stop the Parser.
ms: Hentikan Penghurai Kata.

source: String Representation
ms: Representasi Rentetan

source: String, reordered at word clicked
ms: Rentetan, disusun semula pada perkataan yang diklik

source: &Style
ms: &Gaya

source: Style
ms: Gaya

source: St&yle for following paragraph:
ms: Ga&ya bagi perenggan berikut:

source: Style type:
ms: Jenis gaya:

source: &Style...
ms: &Gaya:

source: Style:
ms: Ga&ya:

source: Styles
ms: Gaya-gaya

source: &Styles...
ms: &Gaya-gaya...

source: _Styles...
ms: _Gaya-gaya...

source: Styles...
ms: Gaya-gaya:

source: &Styles:
ms: &Gaya-gaya:

source: Subcategories
ms: Subkategori

source: Subcategory
ms: Subkategori

source: Subcategory...
ms: Subkategori...

source: Subclasses
ms: Sub kelas

source: Subdomains
ms: Subdomain-subdomain

source: Subentries
ms: Subentri-subentri

source: _Subentry (derivative)
ms: _Subentri (terbitan)

source: Subentry under
ms: Subentri di bawah

source: Subentry Under
ms: Subentri Di bawah

source: Subentry Under Reference
ms: Subentri di bawah Rujukan

source: Subentry/Complex Form Type :
ms: Jenis Subentri/Bentuk Kompleks :

source: Subitem
ms: Sub butir

source: Subitems
ms: Sub butir

source: Subrecord
ms: Sub Rekod

source: Subrecord of
ms: Sub Rekod daripada

source: Subrecord of subrecord
ms: Sub Rekod daripada Sub Rekod

source: Subrecords
ms: Sub rekod

source: Subscrip&t
ms: Subskri&p

source: Subscript
ms: Subskrip

source: Subsense (in sense)
ms: Submakna (di dalam makna)

source: Subsenses
ms: Submakna

source: SubSenses
ms: SubMakna

source: Subsubentries
ms: Subentri-subentri

source: Subtype
ms: Subjenis

source: Subtypes
ms: Subjenis

source: Successful
ms: Berhasil

source: suffix
ms: akhiran

source: {0} Suffix
ms: {0} Akhiran

source: Summary Definition
ms: Definisi Ringkas

source: Sup&erscript
ms: Sup&erskrip

source: Superscript
ms: Superskrip

source: Superseded By
ms: Digantikan oleh

source: Superseded By:
ms: Digantikan Oleh:

source: Support &hierarchy
ms: Sokong &hierarki

source: Supporting Evidence
ms: Bukti Penyokong

source: Supporting Evidence:
ms: Bukti Penyokong:

source: Supporting Files
ms: Fail Penyokong

source: Supporting &files (for example, fonts, keyboards, converters)
ms: &Fail penyokong (contohnya, fon, papan kekunci, penukar)

source: Supporting files (for example, fonts, keyboards, converters)
ms: Fail penyokong (contohnya, fon, papan kekunci, penukar)

source: suprafix
ms: suprafiks

source: {0} Suprafix
ms: {0} Suprafiks

source: Surrounding context:
ms: Konteks sekeliling:

source: &Swap
ms: &Silih

source: Swap Allomorph with Lexeme Form
ms: Silihkan Alomorf dengan Bentuk Leksem

source: Swap Lexeme Form with Allomorph
ms: Silihkan Bentuk Leksem dengan Alomorf

source: Swap Lexeme Form with Allomorph...
ms: Silihkan Bentuk Leksem dengan Alomorf...

source: Swap: "{0}"{2}With: "{1}"
ms: Silihkan: "{0}"{2}Dengan: "{1}"

source: System Default
ms: Asal Sistem

source: System Language for keyboard input:
ms: Bahasa Sistem untuk input papan kekunci:

source: Table
ms: Jadual

source: Tagging
ms: Penandaan

source: Take care - other users connected
ms: Berhati-hati - pengguna lain berkait

source: Target Field:
ms: Bidang Sasaran:

source: Target not found
ms: Sasaran tidak ditemui

source: Targets
ms: Sasaran

source: TECkit (compiled TEC file)
ms: TECkit (fail TEC yang disusun)

source: TECkit (source MAP file)
ms: TECkit (fail MAP sumber)

source: TECkit Mapping Files
ms: Fail Pemetaan TECkit

source: Template Name
ms: Nama Templat

source: Test
ms: Ujian

source: Test the {0} writing system:
ms: Uji sistem penulisan {0}:

source: Text
ms: Teks

source: Text changes:
ms: Perubahan teks:

source: Text Chart
ms: Carta Teks

source: Text Chart Marker
ms: Penanda Carta Teks

source: Text Chart Markers
ms: Penanda-penanda Carta Teks

source: Text Constituent Chart Template
ms: Templat Carta Unsur Teks

source: Text Constituent Chart Templates
ms: Templat-templat Carta Konstituen Teks

source: Text field import options
ms: Opsyen import bidang teks

source: Text Files
ms: Fail-fail Teks

source: Text Files (*.txt)|*.txt|All Files (*.*)|*.*
ms: Fail Teks (*.txt)|*.txt|Semua Fail (*.*)|*.*

source: Text files|*.txt
ms: Fail-fail teks|*.txt

source: Text is {0}
ms: Teks adalah {0}

source: Text is a translation
ms: Teks adalah terjemahan

source: Text Markup Tag
ms: Tag Penanda Teks

source: Text Markup Tags
ms: Tag-tag Penandaan Teks

source: Text to match:
ms: Teks untuk disesuaikan:

source: Text to substitute:
ms: Teks untuk digantikan:

source: texts
ms: teks-teks

source: Texts
ms: Teks-teks

source: _Texts && Words
ms: _Teks && Perkataan

source: Texts & Words
ms: Teks & Perkataan

source: Thank you for checking out this preview version of FieldWorks Language Explorer.
ms: Terima kasih kerana menyemak versi pratonton FieldWorks Language Explorer.

source: Thank you for checking out this version of FieldWorks Language Explorer.
ms: Terima kasih kerana memeriksa versi FieldWorks Language Explorer ini.

source: Thanks, and change the default Linked Files location for this project.
ms: Terima kasih, dan ubah lokasi Fail Terpaut asal bagi projek ini.

source: That name is already in use by another list.
ms: Nama itu sudah dalam penggunaan oleh senarai lain.

source: That name is already in use by another view.
ms: Nama itu sudah dalam penggunaan oleh paparan lain.

source: The "{0}" writing system already exists. To distinguish the new writing system you are creating from "{0}", add script, region and/or variant information.{1}{1}Alternatively, remove this new writing system and use the existing writing system, "{0}", if it meets your needs.
ms: Sistem penulisan "{0}" sudah wujud. Untuk membezakan sistem penulisan baru yang anda sedang buat dari "{0}", tambah skrip, kawasan dan/atau maklumat varian.{1}{1}Sebagai pilihan lain, tanggalkan sistem penulisan baru ini dan gunakan sistem penulisan sedia ada, "{0}", jika keperluan anda terpenuhi.

source: The \{0} field appears {1} times in your data, with the following {2} unique lines.
ms: Bidang \{0} muncul {1} kali dalam data anda, bersama garis-garis unik {2} berikut.

source: The {0} database needs to be updated from version {1} to version {2}.{3}{3}Performing this update could take a while. Do you want to continue with the Update?
ms: Pangkalan data {0} perlu dikemaskini dari versi {1} ke versi {2}.{3}{3}Proses pengemaskinian ini akan mengambil masa yang agak lama. Adakah anda mahu terus Pengemaskinian?

source: The {0} I need is not shown in the Catalog. Create a custom {1}.
ms: {0} yang saya perlukan tidak ditunjukkan dalam Katalog. Buat {1} khas.

source: The {0} you just selected as a complex form of {1} is already saved as a component of {1}. Which item is really a component of the other? Delete the existing relationship before trying to add this one again.
ms: {0} yang baru sahaja anda pilih sebagai bentuk kompleks {1} telah disimpan sebagai komponen {1}. Manakah butir yang benar-benar komponen daripada yang lain? Hapus kaitan yang sedia ada sebelum cuba menambah semula yang ini.

source: The affix process rule and inflection class will be lost! Do you still want to continue?
ms: Peraturan proses imbuhan dan kelas infleksi akan hilang! Adakah anda masih mahu meneruskan?

source: The affix process rule will be lost! Do you still want to continue?
ms: Peraturan proses imbuhan akan hilang! Adakah anda masih mahu meneruskan?

source: The affix process rule, inflection class, and some grammatical information will be lost! Do you still want to continue?
ms: Peraturan proses imbuhan, kelas infleksi, dan beberapa maklumat tatabahasa akan hilang! Adakah anda masih mahu meneruskan?

source: The allomorph is used in these contexts.
ms: Alomorf itu digunakan dalam konteks ini.

source: The backup XML file is either invalid or too old to convert directly.
ms: Fail backup XML adalah tidak sah atau terlalu lama untuk ditukar secara langsung.

source: The category is used in these contexts:
ms: Kategori digunakan dalam konteks-konteks ini:

source: The category of the stem resulting from the attachment of this affix.
ms: Kategori akar hasil daripada pemberian imbuhan ini.

source: The category of the stem to which this affix attaches.
ms: Kategori akar yang kepadanya imbuhan ini bersambung.

source: The category of this part of the compound.
ms: Kategori bahagian kata majmuk ini.

source: The category of this stem or root.
ms: Kategori akar ini.

source: The category, etc. that the resulting stem of the compound is.
ms: Kategori, dsb. tempat hasil akar kata majmuk diletakkan.

source: The Citation Form is used to override the Lexeme Form as the headword in the printed dictionary.
ms: Bentuk Petikan digunakan untuk membatal Bentuk Leksem sebagai kata utama dalam kamus tercetak.

source: The conversion of your projects to the shared format is now complete. To complete the sharing of your projects, you need to set the folder (and subfolders) where your projects are stored to be readable and writable by the other people who will work on your data.
ms: Penukaran projek anda kepada format dikongsikan kini lengkap. Untuk menyelesaikan pengongsian projek anda, anda perlu menata folder (dan subfolder) tempat projek anda disimpan untuk dapat dibaca atau ditulis oleh orang lain yang akan bekerja dalam data anda.

source: The conversion process has failed! Are you sure the input was a backup from FieldWorks version 6.0 or later? The conversion process returned error code {0} and error message {1}.
ms: Proses penukaran gagal! Adakah anda pasti bahawa input adalah merupakan backup daripada FieldWorks versi 6.0 atau yang lebih terkini? Proses penukaran mengembalikan kod ralat {0} dan mesej ralat {1}.

source: The converter is not yet complete.
ms: Penukar belum lengkap.

source: The Converter Mapping File specified cannot be found.
ms: Fail Pemetaan Penukar yang ditentukan tidak dapat dicari.

source: The converter you are trying to create already exists. Do you want to replace it?
ms: Penukar yang anda cuba buat sudah wujud. Adakah anda ingin menggantikannya?

source: The current entry is included as a main entry headword only in publications shown in this field; otherwise, it only appears in references.
ms: Entri semasa termasuk sebagai kata utama entri utama hanya dalam penerbitan yang ditunjukkan dalam bidang ini sahaja; jika tidak, ia hanya muncul dalam rujukan.

source: The current entry is shown as a subentry under the component entries shown in this field in Dictionary.
ms: Entri semasa ditunjukkan sebagai subentri di bawah entri-entri komponen yang ditunjukkan dalam bidang ini dalam Kamus.

source: The cut operation could not be completed. This might be because some parts of what is selected cannot be edited. If this happens unexpectedly please report it as a bug. Please pass on this message: {0}.
ms: Operasi potong tidak dapat disempurnakan. Ini mungkin kerana sesetengah bahagian daripada apa yang dipilih tidak dapat diedit. Jika ini berlaku secara tidak diduga, sila laporkannya sebagai pepijat. Sila sampaikan mesej ini: {0}.

source: The Database folder ({0}) is compressed. A new project cannot be created unless the folder is decompressed. To fix this problem, close down this application and any other open FieldWorks applications. When you next launch a FieldWorks application, there will be an opportunity to fix the folder automatically.
ms: Folder Pangkalan data ({0}) dimampatkan. Projek baru tidak dapat dibuat kecuali folder tersebut dimampatkan. Untuk membaiki masalah itu, tutup aplikasi ini dan mana-mana aplikasi FieldWorks yang dibuka. Apabila anda menjalankan aplikasi FieldWorks nanti, akan berpeluang untuk membaiki folder secara automatik.

source: The Database folder ({0}) is encrypted. A new project cannot be created unless the folder is decrypted. To fix this problem, close down this application and any other open FieldWorks applications. When you next launch a FieldWorks application, there will be an opportunity to fix the folder automatically.
ms: Folder Pangkalan data ({0}) disulitkan. Projek baru tidak dapat dibuat kecuali folder tersebut dinyahsulitkan. Untuk membaiki masalah ini, tutup aplikasi ini dan mana-mana aplikasi FieldWorks terbuka. Apabila anda menjalankan aplikasi FieldWorks nanti, anda akan berpeluang untuk membaiki folder tersebut secara automatik.

source: The default discourse chart template cannot be deleted, moved or promoted.
ms: Templat carta wacana asal tidak dapat dihapus, dipindah atau dinaikkan.

source: The encoding converter repository could not be accessed. A system administrator must either give your account write access to the appropriate directories, or else modify the writing system for you.
ms: Repositori penukar pengekodan tidak dapat dicapai. Seorang pentadbir sistem mestilah memberikan capaian tulis akaun anda kepada direktori-direktori yang sesuai, atau mengubahsuai sistem penulisan untuk anda.

source: The entry is used in these contexts.
ms: Entri itu digunakan di dalam konteks-konteks ini.

source: The entry you have selected is not shown in Dictionary view, {0}.
ms: Entri yang anda pilih tidak ditunjukkan dalam paparan Kamus, {0}.

source: The environment and infix position will be lost! Do you still want to continue?
ms: Sekitaran dan kedudukan sisipan akan hilang! Adakah anda masih mahu meneruskan?

source: The environment and some grammatical information will be lost! Do you still want to continue?
ms: Sekitaran dan beberapa maklumat tatabahasa akan hilang! Adakah anda masih mahu meneruskan?

source: The environment is being used {0} times{1}by your allomorphs.
ms: Sekitaran ini digunakan {0} kali{1}oleh alomorf anda.

source: The environment is being used 1 time{0}by your allomorphs.
ms: Sekitaran ini digunakan 1 kali{0}oleh alomorf anda.

source: The environment will be lost! Do you still want to continue?
ms: Sekitaran akan hilang! Adakah anda masih mahu meneruskan?

source: The environment, infix position, and some grammatical information will be lost! Do you still want to continue?
ms: Sekitaran, kedudukan sisipan dan beberapa maklumat tatabahasa akan hilang! Adakah anda masih mahu meneruskan?

source: The environments describing where the infix may occur with respect to the stem. Testers: Please see section 3.3 of the Conceptual Introduction document for how to key an infix position environment. (A review of section 3.1.3 might also prove helpful.)
ms: Sekitaran yang menghuraikan di mana sisipan mungkin muncul berkenaan dengan akar. Penguji: Sila lihat bahagian 3.3 dokumen Pendahuluan Konseptual untuk meihat cara memasukkan sekitaran kedudukan sisipan. (Meninjau bahagian 3.1.3 mungkin juga dapat membantu.)

source: The environments in which this allomorph occurs. Testers: Please see section 3.1.3 of the Conceptual Introduction document for how to key an environment.
ms: Sekitaran tempat alomorf ini muncul. Penguji: Sila lihat bahagian 3.1.3 dokumen Pendahuluan Konseptual untuk melihat cara memasukkan sesuatu sekitaran.

source: The FieldWorks import process automatically maintains this file.
ms: Proses import FieldWorks secara automatik mengekalkan fail ini.

source: The file specifying the conversion does not exist
ms: Fail yang menentukan penukaran ini tidak wujud

source: The file you have selected is not in the Linked Files folder for this project. Would you like to move or copy the file to that folder to make it easier to share and back up, along with your other project data?
ms: Fail yang sudah anda pilih tidak ada dalam folder Fail Terpaut bagi projek ini. Mahukah anda memindahkan atau menyalin fail tersebut ke folder itu untuk lebih mudah mengongsikan dan membackupnya, bersama-sama dengan data projek anda yang lain?

source: The files this project links to are currently still located in the old FieldWorks folder. Would you like to store those files in the new folder for this project?
ms: Fail-fail yang projek ini pautkan masih lagi terletak dalam folder lama FieldWorks pada masa ini. Mahukah anda menyimpan fail-fail tersebut dalam folder baru bagi projek ini?

source: The filter is being turned off so that you can see the new text.
ms: Penapis telah dimatikan supaya anda boleh melihat teks baru.

source: The Find->Replace expression you have specified will find matches before, after and between all characters. Click OK to continue.
ms: Cari->Ganti ungkapan yang anda telah tentukan akan mencari padanan-padanan sebelum, selepas dan di antara semua aksara. Klik OK untuk teruskan.

source: The following complex form types were added to the language project:
ms: Jenis bentuk kompleks berikut telah ditambah ke projek bahasa:

source: The following Conditions were added to the language project:
ms: Keadaan berikut telah ditambah ke projek bahasa:

source: The following conflicts resulted in duplicated entries or senses:
ms: Percanggahan berikut menghasilkan entri atau makna pendua:

source: The following custom fields were added to the project:
ms: Bidang khas berikut telah ditambah ke projek:

source: The following data was truncated on import:
ms: Data berikut telah dipangkas pada import:

source: The following Domain Types were added to the language project:
ms: Jenis Domain berikut telah ditambah ke projek bahasa:

source: The following Environments were added to the language project:
ms: Sekitaran berikut telah ditambah ke projek bahasa:

source: The following errors were encountered during import:
ms: Ralat berikut telah ditemui semasa import:

source: The following Exception "Features" were added to the language project:
ms: Pengecualian "Ciri" telah ditambah ke project bahasa:

source: The following Feature Types were added to the language project:
ms: Jenis Ciri berikut telah ditambah ke projek bahasa:

source: The following Inflection Classes were added to the language project:
ms: Kelas Infleksi berikut telah ditambah ke projek bahasa:

source: The following Inflection Features were added to the language project:
ms: Ciri Infleksi berikut telah ditambah ke projek bahasa:

source: The following Inflectional Affix Slots were added to the language project:
ms: Slot Imbuhan Infleksi berikut telah ditambah ke projek bahasa:

source: The following inflectional affixes may be added to the obligatory slot {0}.
ms: Imbuhan infleksi berikut mungkin akan ditambahkan ke slot wajib {0}.

source: The following inflectional affixes may be added to the optional slot {0}.
ms: Imbuhan infleksi berikut mungkin akan ditambah ke slot pilihanl {0}.

source: The following invalid data was imported:
ms: Data tidak sah berikut telah diimport:

source: The following invalid relations were found in the imported file:
ms: Kaitan tidak sah berikut telah ditemui dalam fail terimport:

source: The following projects did not migrate successfully:
ms: Projek-projek berikut gagal berhijrah:

source: The following slots are available for the category {0}.
ms: Slot berikut boleh didapati bagi kategori {0}.

source: The following unknown morph-types were found in the imported file:
ms: Jenis morf tidak dikenali berikut ditemui dalam fail terimport:

source: The following writing systems were updated in another project. Would you like to use those changes in this project ({1}) too? {0}
ms: Sistem penulisan berikut telah dikemaskini dalam projek lain. Adakah anda mahu menggunakan semua perubahan dalam projek ({1}) juga? {0}

source: The last remaining Text Markup tag list cannot be deleted.
ms: Senarai tag Penanda Teks yang tertinggal terakhir sekali tidak dapat dihapus.

source: The last time {0} started, it stopped responding when attempting to open the FieldWorks project: {1}
ms: Kali terakhir {0} mula, ia berhenti merespon apabila ia cuba membuka projek FieldWorks: {1}

source: The lexeme form does not match the morpheme type.
ms: Bentuk leksem tidak padan dengan jenis morfem.

source: The lexical reference type is used in this context:
ms: Jenis rujukan leksikal digunakan dalam konteks ini:

source: The link target is not currently available, probably because a filter excludes it. Do you want to turn off the filter?
ms: Sasaran pautan tidak tersedia buat masa ini, kemungkinan ini disebabkan ia dikeluarkan oleh penapis. Adakah anda mahu mematikan penyaring?

source: The Linked Files folder ({0}) does not exist. Please create the folder or insert the USB drive then press Yes. Press No to use the default location.
ms: Folder Fail Terpaut ({0}) tidak wujud. Sila buat folder tersebut atau selitkan pemacu USB kemudian tekan Ya. Tekan Tidak untuk menggunakan lokasi asal.

source: The Linked Files folder on {0} is unavailable. If you are able to re-establish the connection to this folder, do so now. You can continue using FieldWorks without access to those files.
ms: Folder Fail Terpaut di {0} tidak ada. Jika anda dapat menghubung semula sambungan ke folder ini, hubungkan sekarang. Anda boleh teruskan menggunakan FieldWorks tanpa mencapai semua fail itu.

source: The Linked Files folder was not previously stored in the project folder.
ms: Folder Fail Terpaut sebelum ini tidak dikembalikan semula dalam folder projek.

source: The &original name: {0} (will overwrite)
ms: &Nama asal: {0} (akan menulis ganti)

source: The program has detected invalid data (cells out of order or not in any column) within this chart. This can be caused by deleting or re-ordering columns in the template. The program will attempt to repair the links within the data. You may need to do additional editing, or you may prefer to start over if the resulting chart is too different from what you expect.
ms: Program telah mengesan data tak sah (sel-sel tidak tersusun atau tidak satu pun berada dalam kolum) di sekitar carta ini . Penghapusan atau penyusunan semula kolum-kolum dalam templat boleh menyebabkan ini berlaku. Program akan cuba membaiki pautan di sekitar data. Anda perlu penambahan edit, atau anda memilih untuk mula lagi sekiranya penghasilan carta adalah amat berbeza daripada apa yang anda jangkakan.

source: The program may quit after the restore has finished. If it does, you can then restart the program on the (restored) project.
ms: Program akan berhenti setelah pengembalian projek selesai. Jika program berhenti, anda boleh mula semula program pada projek (yang dikembalikan).

source: The project has already been migrated (or created separately).
ms: Projek telah dihijrahkan (atau dibuat berasingan).

source: The project name you entered is too long: {0} Enter a shorter name.
ms: Nama projek yang anda masukkan terlalu panjang: {0} Masukkan nama yang lebih pendek.

source: The Region Abbreviation must be exactly 2 or 3 characters long.
ms: Singkatan Kawasan mestilah 2 atau 3 aksara panjangnya.

source: The region abbreviation you entered is already in use.
ms: Singkatan kawasan yang anda masukkan sudah dalam penggunaan.

source: The requested FieldWorks project could not be opened:
ms: Projek FieldWorks yang diminta tidak dapat dibuka:

source: The selected lexical entry ({0}) is a {1}.
ms: Entri leksikal yang terpilih ({0}) adalah {1}.

source: The selected lexical entry (<CitationForm>) is a <MorphType>.
ms: Entri leksikal terpilih (<BentukPetikan>) adalah <JenisMorf>.

source: The sense is being used in these contexts:
ms: Makna telah digunakan di dalam konteks-konteks ini:

source: The text charting mechanism can only handle one template at this point. Only the first template will be used.
ms: Mekanisme mencartakan teks hanya boleh menangani satu templat pada ketika ini. Hanya templat pertama sahaja akan digunakan.

source: The Text Markup Tags list can only have two levels (tag types and tags).
ms: Senarai Tag Penanda Teks hanya boleh mempunyai dua tahap (jenis tag dan tag-tag).
